app/Http/Controllers/PedidosController.php

    public function index()
    {
        $pedidos = Pedido::with('user')
        ->withCount('itens')
        ->latest()
            ->paginate(15);
---
select * from `users` where `users`.`id` in (1, 2, 3)
select count(*) as `aggregate` from `pedidos`

    public function create()
    {
        return view('pedidos.criar', [
            'produtos' => Produto::query()->pluck('nome', 'id'),
        ]);
---
select `nome`, `id` from `produtos`

    public function store(PedidosStoreRequest $request): RedirectResponse
    {
        $dados = $request->validated();

        $pedido = DB::transaction(function () use ($dados) {
            $pedido = new Pedido();
            $pedido->user_id      = auth()->id();
            $pedido->destino      = $dados['destino'];
            $pedido->observacao   = $dados['observacao'] ?? null;
            $pedido->statusPedido = $dados['statusPedido'];
            $pedido->save();
---
insert into `pedidos` (`user_id`, `destino`, `observacao`, `statusPedido`, `codigo`, `updated_at`, `created_at`) values (1, 'Loja Treze', 'gedgdfgdfvgfdgfdgfdgfdgfd', 'confirmado', 'PED-20260806-LGXF0', '2026-08-06 13:41:27', '2026-08-06 13:41:27')

    public function show(Pedido $pedido): View
    {
        $pedido->load('user', 'itens.produto');
---
select * from `produtos` where `produtos`.`id` in (14, 15)
select * from `users` where `users`.`id` in (1)

    public function edit(Pedido $pedido)
    {
        $pedido->load('itens');

        return view('pedidos.editar', [
            'pedido'   => $pedido,
            'produtos' => Produto::query()->pluck('nome', 'id'),
            'users'    => User::query()->pluck('name', 'id'),
---
select `nome`, `id` from `produtos`
select `name`, `id` from `users`