app/Http/Controllers/ProdutosController.php

select `id`, `nome`, `descricao`, `quantidade`, `sku`, `ean`, `produto_categoria_id`, `produto_status_id` from `produtos` limit 10 offset 0
select count(*) as `aggregate` from `produtos`
---
    public function index(): View
    {
        $produtos = Produto::query()
            ->with(['categoria', 'Status'])
            ->select(['id', 'nome', 'descricao',
                'quantidade', 'sku', 'ean', 'produto_categoria_id', 'produto_status_id'])
            ->paginate(10);

update `produtos` set `nome` = 'Praesentigfdgfdgfdgfdgdfsedstrewytreyr', `produtos`.`updated_at` = '2026-08-06 13:47:44' where `id` = 1
---
    public function update(ProdutosUpdateRequest $request, Produto $produto): RedirectResponse
    {
        $produto->update($request->validated());

select exists(select * from `pedidos_itens` where `pedidos_itens`.`produto_id` = 1 and `pedidos_itens`.`produto_id` is not null) as `exists`
delete from `produtos` where `id` = 1
---
    public function destroy(Produto $produto): RedirectResponse
    {
        if($produto->pedidosItens()->exists()) {
            return redirect()->route('produtos.index')
            ->with('erro', 'Não é possivel excluir: Há pedidos com este produto.');
        }

        $produto->delete();